MikroElektronika/core_packages/ARM/gcc_clang/system/src/ti/mspm0g1/thirdparty/mspm0g1/ti/devices/msp/peripherals/hw_uart.h
/* UART_LCRH Bits */
/* UART_LCRH[BRK] Bits */
#define UART_LCRH_BRK_OFS                        (0)                             /* !< BRK Offset */
#define UART_LCRH_BRK_MASK                       ((uint32_t)0x00000001U)         /* !< UART Send Break (for LIN Protocol) */
#define UART_LCRH_BRK_DISABLE                    ((uint32_t)0x00000000U)         /* !< Normal use. */
#define UART_LCRH_BRK_ENABLE                     ((uint32_t)0x00000001U)         /* !< A low level is continually output
                                                                                    on the UARTxTXD signal, after
                                                                                    completing transmission of the
                                                                                    current character. For the proper
                                                                                    execution of the break command,
                                                                                    software must set this bit for at
                                                                                    least two frames (character periods). */
/* UART_LCRH[PEN] Bits */
#define UART_LCRH_PEN_OFS                        (1)                             /* !< PEN Offset */
#define UART_LCRH_PEN_MASK                       ((uint32_t)0x00000002U)         /* !< UART Parity Enable */
#define UART_LCRH_PEN_DISABLE                    ((uint32_t)0x00000000U)         /* !< Parity is disabled and no parity
                                                                                    bit is added to the data frame. */
#define UART_LCRH_PEN_ENABLE                     ((uint32_t)0x00000002U)         /* !< Parity checking and generation is
                                                                                    enabled. */
/* UART_LCRH[EPS] Bits */
#define UART_LCRH_EPS_OFS                        (2)                             /* !< EPS Offset */
#define UART_LCRH_EPS_MASK                       ((uint32_t)0x00000004U)         /* !< UART Even Parity Select  This bit
                                                                                    has no effect when parity is disabled
                                                                                    by the PEN bit.  For 9-Bit UART Mode
                                                                                    transmissions, this bit controls the
                                                                                    address byte and data byte indication
                                                                                    (9th bit). 0 = The transferred byte
                                                                                    is a data byte 1 = The transferred
                                                                                    byte is an address byte */
#define UART_LCRH_EPS_ODD                        ((uint32_t)0x00000000U)         /* !< Odd parity is performed, which
                                                                                    checks for an odd number of 1s. */
#define UART_LCRH_EPS_EVEN                       ((uint32_t)0x00000004U)         /* !< Even parity generation and checking
                                                                                    is performed during transmission and
                                                                                    reception, which checks for an even
                                                                                    number of 1s in data and parity bits. */
/* UART_LCRH[STP2] Bits */
#define UART_LCRH_STP2_OFS                       (3)                             /* !< STP2 Offset */
#define UART_LCRH_STP2_MASK                      ((uint32_t)0x00000008U)         /* !< UART Two Stop Bits Select     When
                                                                                    in 7816 smart card mode (the SMART
                                                                                    bit is set in the UARTCTL register),
                                                                                    the number of stop bits is forced to
                                                                                    2. */
#define UART_LCRH_STP2_DISABLE                   ((uint32_t)0x00000000U)         /* !< One stop bit is transmitted at the
                                                                                    end of a frame. */
#define UART_LCRH_STP2_ENABLE                    ((uint32_t)0x00000008U)         /* !< Two stop bits are transmitted at
                                                                                    the end of a frame. The receive logic
                                                                                    checks for two stop bits being
                                                                                    received and provide Frame Error if
                                                                                    either is invalid. */
/* UART_LCRH[WLEN] Bits */
#define UART_LCRH_WLEN_OFS                       (4)                             /* !< WLEN Offset */
#define UART_LCRH_WLEN_MASK                      ((uint32_t)0x00000030U)         /* !< UART Word Length  The bits indicate
                                                                                    the number of data bits transmitted
                                                                                    or received in a frame as follows: */
#define UART_LCRH_WLEN_DATABIT5                  ((uint32_t)0x00000000U)         /* !< 5 bits (default) */
#define UART_LCRH_WLEN_DATABIT6                  ((uint32_t)0x00000010U)         /* !< 6 bits */
#define UART_LCRH_WLEN_DATABIT7                  ((uint32_t)0x00000020U)         /* !< 7 bits */
#define UART_LCRH_WLEN_DATABIT8                  ((uint32_t)0x00000030U)         /* !< 8 bits */
/* UART_LCRH[SPS] Bits */
#define UART_LCRH_SPS_OFS                        (6)                             /* !< SPS Offset */
#define UART_LCRH_SPS_MASK                       ((uint32_t)0x00000040U)         /* !< UART Stick Parity Select The Stick
                                                                                    Parity Select (SPS) bit is used to
                                                                                    set either a permanent '1' or a
                                                                                    permanent '0' as parity when
                                                                                    transmitting or receiving data. Its
                                                                                    purpose is to typically indicate the
                                                                                    first byte of a package or to mark an
                                                                                    address byte, for example in a
                                                                                    multi-drop RS-485 network.  When bits
                                                                                    PEN, EPS, and SPS of UARTLCRH are
                                                                                    set, the parity bit is transmitted
                                                                                    and checked as a 0.  When bits PEN
                                                                                    and SPS are set and EPS is cleared,
                                                                                    the parity bit is transmitted and
                                                                                    checked as a 1. */
#define UART_LCRH_SPS_DISABLE                    ((uint32_t)0x00000000U)         /* !< Disable Stick Parity */
#define UART_LCRH_SPS_ENABLE                     ((uint32_t)0x00000040U)         /* !< Enable Stick Parity */
/* UART_LCRH[SENDIDLE] Bits */
#define UART_LCRH_SENDIDLE_OFS                   (7)                             /* !< SENDIDLE Offset */
#define UART_LCRH_SENDIDLE_MASK                  ((uint32_t)0x00000080U)         /* !< UART send IDLE pattern. When this
                                                                                    bit is set an SENDIDLE period of 11
                                                                                    bit times will be sent on the TX
                                                                                    line. The bit is cleared by hardware
                                                                                    afterwards. */
#define UART_LCRH_SENDIDLE_DISABLE               ((uint32_t)0x00000000U)         /* !< Disable Send Idle Pattern */
#define UART_LCRH_SENDIDLE_ENABLE                ((uint32_t)0x00000080U)         /* !< Enable Send Idle Pattern */
/* UART_LCRH[EXTDIR_SETUP] Bits */
#define UART_LCRH_EXTDIR_SETUP_OFS               (16)                            /* !< EXTDIR_SETUP Offset */
#define UART_LCRH_EXTDIR_SETUP_MASK              ((uint32_t)0x001F0000U)         /* !< Defines the number of UARTclk ticks
                                                                                    the signal to control the external
                                                                                    driver for the RS485 will be set
                                                                                    before the START bit is send */
#define UART_LCRH_EXTDIR_SETUP_MINIMUM           ((uint32_t)0x00000000U)         /* !< Smallest value */
#define UART_LCRH_EXTDIR_SETUP_MAXIMUM           ((uint32_t)0x001F0000U)         /* !< Highest possible value */
/* UART_LCRH[EXTDIR_HOLD] Bits */
#define UART_LCRH_EXTDIR_HOLD_OFS                (21)                            /* !< EXTDIR_HOLD Offset */
#define UART_LCRH_EXTDIR_HOLD_MASK               ((uint32_t)0x03E00000U)         /* !< Defines the number of UARTclk ticks
                                                                                    the signal to control the external
                                                                                    driver for the RS485 will be reset
                                                                                    after the beginning of the stop bit.
                                                                                    (If 2 STOP bits are enabled the
                                                                                    beginning of the 2nd STOP bit.) */
#define UART_LCRH_EXTDIR_HOLD_MINIMUM            ((uint32_t)0x00000000U)         /* !< Smallest value */
#define UART_LCRH_EXTDIR_HOLD_MAXIMUM            ((uint32_t)0x03E00000U)         /* !< Highest possible value */

/* UART_STAT Bits */
/* UART_STAT[BUSY] Bits */
#define UART_STAT_BUSY_OFS                       (0)                             /* !< BUSY Offset */
#define UART_STAT_BUSY_MASK                      ((uint32_t)0x00000001U)         /* !< UART Busy This bit is set as soon
                                                                                    as the transmit FIFO or TXDATA
                                                                                    register becomes non-empty
                                                                                    (regardless of whether UART is
                                                                                    enabled) or if a receive data is
                                                                                    currently ongoing (after the start
                                                                                    edge have been detected until a
                                                                                    complete byte, including all stop
                                                                                    bits, has been received by the shift
                                                                                    register). In IDLE_Line mode the Busy
                                                                                    signal also stays set during the idle
                                                                                    time generation. */
#define UART_STAT_BUSY_CLEARED                   ((uint32_t)0x00000000U)         /* !< The UART is not busy. */
#define UART_STAT_BUSY_SET                       ((uint32_t)0x00000001U)         /* !< The UART is busy transmitting data.
                                                                                    This bit remains set until the
                                                                                    complete byte, including all stop
                                                                                    bits, has been sent/received
                                                                                    from/into the shift register. */
/* UART_STAT[TXFF] Bits */
#define UART_STAT_TXFF_OFS                       (7)                             /* !< TXFF Offset */
#define UART_STAT_TXFF_MASK                      ((uint32_t)0x00000080U)         /* !< UART Transmit FIFO Full  The
                                                                                    meaning of this bit depends on the
                                                                                    state of the FEN bit in the CTL0
                                                                                    register. */
#define UART_STAT_TXFF_CLEARED                   ((uint32_t)0x00000000U)         /* !< The transmitter is not full. */
#define UART_STAT_TXFF_SET                       ((uint32_t)0x00000080U)         /* !< If the FIFO is disabled (FEN is 0),
                                                                                    the transmit holding register is
                                                                                    full. If the FIFO is enabled (FEN is
                                                                                    1), the transmit FIFO is full. */
/* UART_STAT[RXFF] Bits */
#define UART_STAT_RXFF_OFS                       (3)                             /* !< RXFF Offset */
#define UART_STAT_RXFF_MASK                      ((uint32_t)0x00000008U)         /* !< UART Receive FIFO Full  The meaning
                                                                                    of this bit depends on the state of
                                                                                    the FEN bit in the CTL0 register. */
#define UART_STAT_RXFF_CLEARED                   ((uint32_t)0x00000000U)         /* !< The receiver can receive data. */
#define UART_STAT_RXFF_SET                       ((uint32_t)0x00000008U)         /* !< If the FIFO is disabled (FEN is 0),
                                                                                    the receive holding register is full.
                                                                                    If the FIFO is enabled (FEN is 1),
                                                                                    the receive FIFO is full. */
/* UART_STAT[TXFE] Bits */
#define UART_STAT_TXFE_OFS                       (6)                             /* !< TXFE Offset */
#define UART_STAT_TXFE_MASK                      ((uint32_t)0x00000040U)         /* !< UART Transmit FIFO Empty  The
                                                                                    meaning of this bit depends on the
                                                                                    state of the FEN bit in the CTL0
                                                                                    register. */
#define UART_STAT_TXFE_CLEARED                   ((uint32_t)0x00000000U)         /* !< The transmitter has data to
                                                                                    transmit. */
#define UART_STAT_TXFE_SET                       ((uint32_t)0x00000040U)         /* !< If the FIFO is disabled (FEN is 0),
                                                                                    the transmit holding register is
                                                                                    empty. If the FIFO is enabled (FEN is
                                                                                    1), the transmit FIFO is empty. */
/* UART_STAT[CTS] Bits */
#define UART_STAT_CTS_OFS                        (8)                             /* !< CTS Offset */
#define UART_STAT_CTS_MASK                       ((uint32_t)0x00000100U)         /* !< Clear To Send */
#define UART_STAT_CTS_CLEARED                    ((uint32_t)0x00000000U)         /* !< The CTS signal is not asserted
                                                                                    (high). */
#define UART_STAT_CTS_SET                        ((uint32_t)0x00000100U)         /* !< The CTS signal is asserted (low). */
/* UART_STAT[IDLE] Bits */
#define UART_STAT_IDLE_OFS                       (9)                             /* !< IDLE Offset */
#define UART_STAT_IDLE_MASK                      ((uint32_t)0x00000200U)         /* !< IDLE mode has been detected in
                                                                                    Idleline-Multiprocessor-Mode. The
                                                                                    IDLE bit is used as an address tag
                                                                                    for each block of characters. In
                                                                                    idle-line multiprocessor format, this
                                                                                    bit is set when a received character
                                                                                    is an address. */
#define UART_STAT_IDLE_CLEARED                   ((uint32_t)0x00000000U)         /* !< IDLE has not been detected before
                                                                                    last received character. (In
                                                                                    idle-line multiprocessor mode). */
#define UART_STAT_IDLE_SET                       ((uint32_t)0x00000200U)         /* !< IDLE has been detected before last
                                                                                    received character. (In idle-line
                                                                                    multiprocessor mode). */
/* UART_STAT[RXFE] Bits */
#define UART_STAT_RXFE_OFS                       (2)                             /* !< RXFE Offset */
#define UART_STAT_RXFE_MASK                      ((uint32_t)0x00000004U)         /* !< UART Receive FIFO Empty  The
                                                                                    meaning of this bit depends on the
                                                                                    state of the FEN bit in the CTL0
                                                                                    register. */
#define UART_STAT_RXFE_CLEARED                   ((uint32_t)0x00000000U)         /* !< The receiver is not empty. */
#define UART_STAT_RXFE_SET                       ((uint32_t)0x00000004U)         /* !< If the FIFO is disabled (FEN is 0),
                                                                                    the receive holding register is
                                                                                    empty. If the FIFO is enabled (FEN is
                                                                                    1), the receive FIFO is empty. */

